
## Plan Result (aat)




<pre><code>Plan: 3 to add, 13 to change, 0 to destroy.</code></pre>

* Create
  * module.cft_api_mgmt.azurerm_api_management_api.api
  * module.cft_api_mgmt.azurerm_api_management_product_api.link_to_product[0]
  * module.cft_api_mgmt_policy.azurerm_api_management_api_policy.api_policy
* Update
  * azurerm_api_management_subscription.bulk_scan_team_subscription
  * azurerm_api_management_subscription.exela_supplier_subscription
  * azurerm_api_management_subscription.iron_mountain_supplier_subscription
  * azurerm_key_vault_secret.flexible_secret_staging[&#34;host&#34;]
  * azurerm_key_vault_secret.flexible_secret_staging[&#34;name&#34;]
  * azurerm_key_vault_secret.flexible_secret_staging[&#34;password&#34;]
  * azurerm_key_vault_secret.flexible_secret_staging[&#34;port&#34;]
  * azurerm_key_vault_secret.flexible_secret_staging[&#34;user&#34;]
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;DATABASE&#34;]
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;HOST&#34;]
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;PASS&#34;]
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;PORT&#34;]
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;USER&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_api_management_subscription.bulk_scan_team_subscription will be updated in-place
  ~ resource "azurerm_api_management_subscription" "bulk_scan_team_subscription" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-stg/subscriptions/6854c784-1630-4319-86c7-80174ccf536f"
        # (8 unchanged attributes hidden)
    }

  # azurerm_api_management_subscription.exela_supplier_subscription will be updated in-place
  ~ resource "azurerm_api_management_subscription" "exela_supplier_subscription" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-stg/subscriptions/c2218f5b-5b37-4a88-87ec-b4cdaf245280"
        # (8 unchanged attributes hidden)
    }

  # azurerm_api_management_subscription.iron_mountain_supplier_subscription will be updated in-place
  ~ resource "azurerm_api_management_subscription" "iron_mountain_supplier_subscription" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-stg/subscriptions/d9561dea-8d9a-4b8c-8088-318e018da063"
        # (8 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_staging["host"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_staging" {
      ~ expiration_date         = "2026-06-07T08:41:14Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/blob-router-staging-flexible-db-host/51af603b98ee42aca7cf2631adc3bbe0"
        name                    = "blob-router-staging-flexible-db-host"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_staging["name"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_staging" {
      ~ expiration_date         = "2026-06-07T08:41:14Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/blob-router-staging-flexible-db-name/1b3b5c5e0c554eb89a60aef83a27c8cb"
        name                    = "blob-router-staging-flexible-db-name"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_staging["password"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_staging" {
      ~ expiration_date         = "2026-06-07T08:41:14Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/blob-router-staging-flexible-db-password/f4dab7117dd94d0c917122dc8264f07f"
        name                    = "blob-router-staging-flexible-db-password"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_staging["port"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_staging" {
      ~ expiration_date         = "2026-06-07T08:41:14Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/blob-router-staging-flexible-db-port/3f6911f2652641e28c00c0f7617e8352"
        name                    = "blob-router-staging-flexible-db-port"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_staging["user"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_staging" {
      ~ expiration_date         = "2026-06-07T08:41:14Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/blob-router-staging-flexible-db-user/dceb88eefa2e4175b5479e9433a0a42c"
        name                    = "blob-router-staging-flexible-db-user"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["DATABASE"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      ~ expiration_date         = "2026-06-07T08:41:14Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/blob-router-POSTGRES-DATABASE/7a0447b3f9f6468e8254dd6cd6a251fe"
        name                    = "blob-router-POSTGRES-DATABASE"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["HOST"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      ~ expiration_date         = "2026-06-07T08:41:14Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/blob-router-POSTGRES-HOST/e6389c15635b4b6fb3a25730d66faa8d"
        name                    = "blob-router-POSTGRES-HOST"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["PASS"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      ~ expiration_date         = "2026-06-07T08:41:14Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/blob-router-POSTGRES-PASS/7dfccbdee4744013b65f47dcb5e16581"
        name                    = "blob-router-POSTGRES-PASS"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["PORT"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      ~ expiration_date         = "2026-06-07T08:41:14Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/blob-router-POSTGRES-PORT/4130bc7a2b324a03b6f605cecd9558da"
        name                    = "blob-router-POSTGRES-PORT"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["USER"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      ~ expiration_date         = "2026-06-07T08:41:14Z" -> (known after apply)
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/blob-router-POSTGRES-USER/030d6661b5ff4e76ba34d7f3918a3609"
        name                    = "blob-router-POSTGRES-USER"
        tags                    = {
            "application"         = "bulk-scan-print"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "staging"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # module.cft_api_mgmt.azurerm_api_management_api.api will be created
  + resource "azurerm_api_management_api" "api" {
      + api_management_name   = "cft-api-mgmt-stg"
      + api_type              = "http"
      + display_name          = "Blob Router API"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "blob-router-api"
      + path                  = "reform-scan"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "cft-aat-network-rg"
      + revision              = "1"
      + service_url           = "http://reform-scan-blob-router-aat.service.core-compute-aat.internal"
      + soap_pass_through     = (known after apply)
      + subscription_required = true
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi-link"
          + content_value  = "https://hmcts.github.io/cnp-api-docs/specs/blob-router-service.json"
        }
    }

  # module.cft_api_mgmt.azurerm_api_management_product_api.link_to_product[0] will be created
  + resource "azurerm_api_management_product_api" "link_to_product" {
      + api_management_name = "cft-api-mgmt-stg"
      + api_name            = "blob-router-api"
      + id                  = (known after apply)
      + product_id          = "blob-router"
      + resource_group_name = "cft-aat-network-rg"
    }

  # module.cft_api_mgmt_policy.azurerm_api_management_api_policy.api_policy will be created
  + resource "azurerm_api_management_api_policy" "api_policy" {
      + api_management_name = "cft-api-mgmt-stg"
      + api_name            = "blob-router-api"
      + id                  = (known after apply)
      + resource_group_name = "cft-aat-network-rg"
      + xml_content         = <<-EOT
            <policies>
              <backend>
                <base/>
              </backend>
              <inbound>
                <base/>
                <choose>
                  <when condition="@(context.Request.Certificate == null)" >
                    <return-response>
                      <set-status code="401" />
                      <set-body>Missing client certificate</set-body>
                    </return-response>
                  </when>
                  <when condition="@(context.Request.Certificate.NotAfter &lt; DateTime.Now || context.Request.Certificate.NotBefore &gt; DateTime.Now || !(new string[] {&quot;83F6ADA16BAA1E601CED746C89D12062CCFE0391&quot;,&quot;D593AF43215C219EEA637A851F55FC9C03EE4A00&quot;,&quot;41B0BA6FF84CE7BDB1F7864BC9248CFBF107B54E&quot;,&quot;792265A947D0C76D4F67A0878B1D06E60976DFDA&quot;}.Any(c => c == context.Request.Certificate.Thumbprint)))" >
                    <return-response>
                      <set-status code="401" />
                      <set-body>Invalid client certificate</set-body>
                    </return-response>
                  </when>
                  <!-- Reconciliation endpoint -->
                  <when condition="@(context.Request.Url.Path.Contains(&quot;reconciliation-report&quot;))">
                    <send-request mode="new" response-variable-name="apiKeySecret" timeout="20" ignore-error="false">
                      <set-url>https://reform-scan-{{environment}}.vault.azure.net/secrets/reconciliation-api-key/?api-version=7.0</set-url>
                      <set-method>GET</set-method>
                      <authentication-managed-identity resource="https://vault.azure.net" />
                    </send-request>
                    <!-- transform keyvault secret response to string -->
                    <set-variable name="apiKeySecretResponse" value="@{
                            var secret = ((IResponse)context.Variables[&quot;apiKeySecret&quot;]).Body.As<JObject>();
                            return secret[&quot;value&quot;].ToString();
                        }" />
                    <!-- Set Apikey with Bearer as Authorization header -->
                    <set-header name="Authorization" exists-action="override">
                      <value>@("Bearer " + (string)context.Variables["apiKeySecretResponse"])</value>
                    </set-header>
                  </when>
                </choose>
              </inbound>
              <outbound>
                <base/>
              </outbound>
              <on-error>
                <base/>
              </on-error>
            </policies>
        EOT
    }

Plan: 3 to add, 13 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":2226,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->